---
type: KeyBasedTreeEntriesLoadResults
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# KeyBasedTreeEntriesLoadResults

`Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | KeyBasedTreeEntriesLoadResults | 2015 | `public KeyBasedTreeEntriesLoadResults ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetFailureMessages | 2015 | `public IList < FailureMessage > GetFailureMessages ()` |
| Method | GetFileReadErrors | 2015 | `public IList < string > GetFileReadErrors ()` |
| Method | GetFileSyntaxErrors | 2015 | `public IList < string > GetFileSyntaxErrors ()` |
| Method | GetKeyBasedTreeEntryErrors | — | `` |
| Method | GetKeyBasedTreeEntryErrors | 2015 | `public IList < KeyBasedTreeEntryError > GetKeyBasedTreeEntryErrors ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |